# Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

def weekend():
    num = input("Введите число: ")
    while num.isdigit() is not True:
        print("Такого дня недели не существует")
        num = input("Введите число: ")
    num = int(num)
    if 1 <= num <= 5:
        print("Нет")
    elif num == 6 or num == 7:
        print("Да")
    else:
        print("Такого дня недели не существует")

weekend()
